#Область Сложить

&НаКлиенте
Процедура Сложить(Команда)
    СложитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СложитьНаСервере()
    Объект.Результат = Объект.Число1 + Объект.Число2;
    Сообщить("Результат: " + Формат(Объект.Результат, "ЧГ=0"));
КонецПроцедуры

#КонецОбласті

#Область Очистить

&НаКлиенте
Процедура Очистить(Команда)
    ОчиститьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОчиститьНаСервере()
    Объект.Число1 = 0;
    Объект.Число2 = 0;
    Объект.Результат = 0;
    Сообщить("Очищено");
КонецПроцедуры

#КонецОбласті
