#Область ОбработчикиСобытийФормы

// Обработчики событий формы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Обработчики событий элементов формы

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Добавить(Команда)

	ДобавитьНаСервере();

КонецПроцедуры

&НаСервере
Процедура ДобавитьНаСервере()

	Объект.Результат = Объект.Число1 + Объект.Число2;
	Сообщить("Додавання виконано: " + Объект.Результат);

КонецПроцедуры

&НаКлиенте
Процедура Вычесть(Команда)

	ВычестьНаСервере();

КонецПроцедуры

&НаСервере
Процедура ВычестьНаСервере()

	Объект.Результат = Объект.Число1 - Объект.Число2;
	Сообщить("Віднімання виконано: " + Объект.Результат);

КонецПроцедуры

&НаКлиенте
Процедура Умножить(Команда)

	УмножитьНаСервере();

КонецПроцедуры

&НаСервере
Процедура УмножитьНаСервере()

	Объект.Результат = Объект.Число1 * Объект.Число2;
	Сообщить("Множення виконано: " + Объект.Результат);

КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// Вспомогательные функции

#КонецОбласти